Тестовая_база_ERP_14/src/Catalogs/РолиИсполнителей/РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиИсполнителей</name>
  <predefined>
    <items>
      <name>ОтветственныйЗаКонтрольИсполнения</name>
      <description>Координатор выполнения задач</description>
    </items>
    <items>
      <name>СогласующийЗаявкиНаВозвратТоваровОтКлиентов</name>
      <description>Согласующий заявки на возврат товаров от клиентов</description>
    </items>
    <items>
      <name>СогласующийКоммерческиеУсловияЗакупок</name>
      <description>Согласующий коммерческие условия закупок</description>
    </items>
    <items>
      <name>СогласующийКоммерческиеУсловияПродаж</name>
      <description>Согласующий коммерческие условия продаж</description>
    </items>
    <items>
      <name>СогласующийЛогистическиеУсловияЗакупок</name>
      <description>Согласующий логистические условия закупок</description>
    </items>
    <items>
      <name>СогласующийЛогистическиеУсловияПродаж</name>
      <description>Согласующий логистические условия продаж</description>
    </items>
    <items>
      <name>СогласующийУстановкиЦенНоменклатуры</name>
      <description>Согласующий установки цен номенклатуры</description>
    </items>
    <items>
      <name>СогласующийФинансовыеУсловияЗакупок</name>
      <description>Согласующий финансовые условия закупок</description>
    </items>
    <items>
      <name>СогласующийФинансовыеУсловияПродаж</name>
      <description>Согласующий финансовые условия продаж</description>
    </items>
    <items>
      <name>СогласующийЦеновыеУсловияЗакупок</name>
      <description>Согласующий ценовые условия закупок</description>
    </items>
    <items>
      <name>СогласующийЦеновыеУсловияПродаж</name>
      <description>Согласующий ценовые условия продаж</description>
    </items>
  </predefined>
  <attributes>
    <name>ИспользуетсяБезОбъектовАдресации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСОбъектамиАдресации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыДополнительногоОбъектаАдресации</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыОсновногоОбъектаАдресации</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяРоль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначение</name>
    <attributes>
      <name>ТипПользователей</name>
      <type>
        <types>DefinedType.Пользователь</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/РолиИсполнителей/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ИспользуетсяСОбъектамиАдресации И НЕ ИспользуетсяБезОбъектовАдресации Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не указаны допустимые способы назначения исполнителей на роль: совместно с объектами адресации, без них или обоими способами.';
				|en = 'Allowable methods to assign assignees for a role are not specified: with addressing objects, without them or using both methods.'"),
		 	ЭтотОбъект, "ИспользуетсяБезОбъектовАдресации",,Отказ);
		Возврат;
	КонецЕсли;
	
	Если НЕ ИспользуетсяСОбъектамиАдресации Тогда
		Возврат;
	КонецЕсли;
	
	ЗаданыТипыОсновногоОбъектаАдресации = ТипыОсновногоОбъектаАдресации <> Неопределено И НЕ ТипыОсновногоОбъектаАдресации.Пустая();
	Если НЕ ЗаданыТипыОсновногоОбъектаАдресации Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указаны типы основного объекта адресации.';
													|en = 'Types of the main addressing object are not specified.'"),
		 	ЭтотОбъект, "ТипыОсновногоОбъектаАдресации",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если ТипыОсновногоОбъектаАдресации <> Неопределено И ТипыОсновногоОбъектаАдресации.Пустая() Тогда
		ТипыОсновногоОбъектаАдресации = Неопределено;
	КонецЕсли;
	
	Если ТипыДополнительногоОбъектаАдресации <> Неопределено И ТипыДополнительногоОбъектаАдресации.Пустая() Тогда
		ТипыДополнительногоОбъектаАдресации = Неопределено;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВнешнихПользователей") Тогда
		Если Назначение.Найти(Справочники.Пользователи.ПустаяСсылка(), "ТипПользователей") = Неопределено Тогда
			// При отключенных внешних пользователях, роль всегда должна быть назначена пользователям.
			Назначение.Добавить().ТипПользователей = Справочники.Пользователи.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on client.'");
#КонецЕсли
